groupmates = [
    {
        'name': 'Кирилл',
        'surname': 'Михайлов',
        'exams': ['Философия', 'Введение в ИТ', 'Алгебра и геометрия'],
        'marks': [5, 5, 5]
    },
    {
        'name': 'Юрий',
        'surname': 'Дружинин',
        'exams': ['Философия', 'Введение в ИТ', 'Алгебра и геометрия'],
        'marks': [5, 5, 4]
    },
    {
        'name': 'Артём',
        'surname': 'Усачёв',
        'exams': ['Философия', 'Введение в ИТ', 'Алгебра и геометрия'],
        'marks': [5, 5, 5]
    },
    {
        'name': 'Арсений',
        'surname': 'Дрейман',
        'exams': ['Философия', 'Введение в ИТ', 'Алгебра и геометрия'],
        'marks': [5, 5, 5]
    },
    {
        'name': 'Максим',
        'surname': 'Тарасов',
        'exams': ['Философия', 'Введение в ИТ', 'Алгебра и геометрия'],
        'marks': [5, 5, 5]
    }
]